Revit 2026 API

# AngularDimensionCreate Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static AngularDimension Create(
	Document document,
	View dbView,
	Arc arc,
	IList<Reference> references,
	DimensionType dimensionStyle
)
```
```vb
Public Shared Function Create (
	document As Document,
	dbView As View,
	arc As Arc,
	references As IList(Of Reference),
	dimensionStyle As DimensionType
) As AngularDimension
```
```cpp
public:
static AngularDimension^ Create(
	Document^ document,
	View^ dbView,
	Arc^ arc,
	IList<Reference^>^ references,
	DimensionType^ dimensionStyle
)
```
```fsharp
static member Create :
        document : Document *
        dbView : View *
        arc : Arc *
        references : IList<Reference> *
        dimensionStyle : DimensionType -> AngularDimension
```

#### Parameters

document Document

dbView View

arc Arc

references IListReference

dimensionStyle DimensionType

#### Return Value

AngularDimension

#### Reference

AngularDimension Class

Autodesk.Revit.DB Namespace